Enums/ВерсииСоставаЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВерсииСоставаЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Версия10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия30</Name>
					<Comment>Версия 3.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия40</Name>
					<Comment>Версия 4.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия50</Name>
					<Comment>Версия 5.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия60</Name>
					<Comment>Версия 6.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия70</Name>
					<Comment>Версия 7.0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия80</Name>
					<Comment>Версия 8.0</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВерсииСоставаЭД/Ext/ManagerModule.bsl
Функция ЕстьОпцияВВерсии(Версия, Опция) Экспорт
	
	Опция = ВРЕГ(Опция);
	
	Если Опция = "ИНТЕГРАЦИЯ" Тогда
		
		Если Версия = Перечисления.ВерсииСоставаЭД.Версия10 
			ИЛИ Версия = Перечисления.ВерсииСоставаЭД.Версия20
			ИЛИ Версия = Перечисления.ВерсииСоставаЭД.Версия30
			ИЛИ Версия = Перечисления.ВерсииСоставаЭД.Версия40 Тогда
			
			Возврат Ложь;
			
		Иначе
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
